serverBlips = {
	{8,"Városháza",1037.416015625, 999.5712890625, 62.248237609863},
	{45,"Ruhabolt",1667.013671875, 1734.2607421875, 14.159954071045},
	{55,"Autókereskedés",1688.6220703125, 1815.9228515625, 14.159954071045},
	{22,"Kórház",1606.818359375, 1815.2451171875, 10.8203125},
    {11,"Benzinkút",1599.3583984375, 2201.9228515625, 11.1328125},
	{11,"Benzinkút",2200.490234375, 2477.255859375, 11.1328125},
	{30,"Police",2284.1435546875, 2459.2783203125, 50.1328125},
	{5,"Repülőtér",1441.4794921875, 1448.158203125, 44.1328125},
	{11,"Benzinkút",2638.095703125, 1105.3408203125, 11.1328125},
    {63,"Szerelőtelep",1070.03125, 1304.6396484375, 13.1328125},
	{52,"Bank",2473.69140625, 1037.19140625, 10.671875},
	{27,"Tuning",1069.4697265625, 2097.693359375, 11.587852478027},
	{5,"Repülőtér",181.306640625, 2503.8525390625, 24.334341049194},
	{9,"Horgász tó",626.2783203125, 853.3896484375, 32.289173126221},
	{30,"Sheriff hivatal",950.70703125, 1732.78125, 10.342931747437},
	{10,"Burger Shoot",2374.279296875, 2074.5458984375, 10.671875},
	{14,"Cluckin' Bell",183.404296875, 1178.56640625, 24.671875},
	{28,"King Ring",-146.5400390625, 1228.7451171875, 24.671875},
	{31,"Átkelőhely",-882.5732421875, 1982.58984375, 60.671875},
	{31,"Átkelőhely",-1102.2197265625, 2700.8662109375, 47.671875},
	{31,"Átkelőhely",-883.015625, 1655.0302734375, 27.671875},
	{31,"Átkelőhely",-483.6494140625, 1057.5068359375, 9.671875},
	{31,"Átkelőhely",-626.349609375, 645.4931640625, 17.671875},
	{32,"Autós iskola",1171.2060546875, 1355.927734375, 15.671875},
	{10,"Burger Shoot",1868.412109375, 2083.4931640625, 18.671875},
	{34,"Méhészet",-688.4462890625, 936.0576171875, 13.6328125},
}

function inBox(dX, dY, dSZ, dM, eX, eY)
	if(eX >= dX and eX <= dX+dSZ and eY >= dY and eY <= dY+dM) then
		return true
	else
		return false
	end
end

function isInSlot(xS,yS,wS,hS)
	if(isCursorShowing()) then
		XY = {guiGetScreenSize()}
		local cursorX, cursorY = getCursorPosition()
		cursorX, cursorY = cursorX*XY[1], cursorY*XY[2]
		if(inBox(xS,yS,wS,hS, cursorX, cursorY)) then
			return true
		else
			return false
		end
	end	
end

function reMap(value, low1, high1, low2, high2)
    return low2 + (value - low1) * (high2 - low2) / (high1 - low1)
end